In [2]:
import pandas as pd

In [3]:
contato = {
    'nome': ['samuka', 'marcos', 'willian'],
    'idade': [30, 27, 42],
    'telefone': [321654789, 123789654, 986547825],
    'e-mail': [
        'samuka@samuka.com',
        'marcos@marcos.com',
        'willian@willian.com',
    ],
    'salário': [2530.78, 6845.63, 9245.63],
}

# em DataFrame
df = pd.DataFrame(contato)

In [4]:
df.head()

      nome  idade   telefone               e-mail  salário
0   samuka     30  321654789    samuka@samuka.com  2530.78
1   marcos     27  123789654    marcos@marcos.com  6845.63
2  willian     42  986547825  willian@willian.com  9245.63

In [5]:
contato2 = {
    'nome': 'willian',
    'idade': 42,
    'telefone': 986547825,
    'e-mail': 'willian@willian.com',
    'salário': 9245.63,
}

# em DataFrame
ds = pd.Series(contato2)

In [6]:
ds

nome                    willian
idade                        42
telefone              986547825
e-mail      willian@willian.com
salário                 9245.63
dtype: object

In [7]:
# gera com novo ID caso tenha igual duplica
ds_f = ds.to_frame().T
ds_f

      nome idade   telefone               e-mail  salário
0  willian    42  986547825  willian@willian.com  9245.63

In [8]:
pd.concat([df, ds_f])

      nome idade   telefone               e-mail  salário
0   samuka    30  321654789    samuka@samuka.com  2530.78
1   marcos    27  123789654    marcos@marcos.com  6845.63
2  willian    42  986547825  willian@willian.com  9245.63
0  willian    42  986547825  willian@willian.com  9245.63

In [9]:
df.loc[len(df)] = ds

In [10]:
df

      nome  idade   telefone               e-mail  salário
0   samuka     30  321654789    samuka@samuka.com  2530.78
1   marcos     27  123789654    marcos@marcos.com  6845.63
2  willian     42  986547825  willian@willian.com  9245.63
3  willian     42  986547825  willian@willian.com  9245.63

In [11]:
# gera com novo ID caso tenha igual NAO duplica POIS TEM IGNORE
pd.concat([df, ds.to_frame().T], ignore_index=True)

      nome idade   telefone               e-mail  salário
0   samuka    30  321654789    samuka@samuka.com  2530.78
1   marcos    27  123789654    marcos@marcos.com  6845.63
2  willian    42  986547825  willian@willian.com  9245.63
3  willian    42  986547825  willian@willian.com  9245.63
4  willian    42  986547825  willian@willian.com  9245.63

In [12]:
df.iloc[1]

nome                   marcos
idade                      27
telefone            123789654
e-mail      marcos@marcos.com
salário               6845.63
Name: 1, dtype: object

In [13]:
df

      nome  idade   telefone               e-mail  salário
0   samuka     30  321654789    samuka@samuka.com  2530.78
1   marcos     27  123789654    marcos@marcos.com  6845.63
2  willian     42  986547825  willian@willian.com  9245.63
3  willian     42  986547825  willian@willian.com  9245.63